src/assets/artifacts/JPetStore/behavior-models/efsm_diagram/efsm_model.mmd
stateDiagram-v2
  direction LR
  q0 --> q5 : AccountService.getAccount [password in {"j2ee", "password"} and username in {"j2ee", 1788085673468}]
  q0 --> q0 : AccountService.insertAccount [account == "org.mybatis.jpetstore.domain.Account@46a1969a"]
  q0 --> q2 : CatalogService.getItem [itemId in {"EST-1", "EST-18", "EST-20"}]
  q0 --> q3 : CatalogService.getItemListByProduct [productId in {"FI-SW-01", "FI-FW-02", "AV-CB-01"}]
  q0 --> q1 : CatalogService.getProductListByCategory [categoryId in {"BIRDS", "FISH", "DOGS", "REPTILES", "CATS"}]
  q0 --> q0 : CatalogService.isItemInStock [itemId in {"EST-18", "EST-20"}]
  q0 --> q2 : CatalogService.searchProductList [keywords == "fish"]
  q0 --> q2 : OrderService.getOrder [orderId == 1000]
  q0 --> q2 : OrderService.getOrdersByUsername [username == "j2ee"]
  q0 --> q4 : OrderService.insertOrder [order == "org.mybatis.jpetstore.domain.Order@cd28589"]
  q0 --> q2 : ResponseFacade.sendRedirect
  q1 --> q2 : CatalogService.getCategory [categoryId in {"BIRDS", "FISH", "DOGS", "REPTILES", "CATS"}]
  q3 --> q2 : CatalogService.getProduct [productId in {"FI-SW-01", "FI-FW-02", "AV-CB-01"}]
  q4 --> q2 : OrderService.getNextId [name == "ordernum"]
  q5 --> q0 : CatalogService.getProductListByCategory [categoryId in {"DOGS", "CATS"}]

  %% Accepting states
  note right of q2
    accepting
  end note
